Table of Contents
 Enum LocalisedMessage
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public enum LocalisedMessage
Fields
AwaitingUserSelection = 22
CancellingImport = 7
ConvertingModelFromXML = 17
CreatingConnection = 8
FinishingImport = 20
ImportFailed = 12
ImportStarted = 11
ImportingConnections = 2
ImportingGroups = 0
ImportingIOMObject = 9
ImportingMembers = 1
ImportingStructuralModel = 10
InternalImport = 14
InternalSync = 3
Member = 15
ModelImport = 6
ModelPostProcess = 13
ProcessingConnection = 19
ProcessingSubstructure = 18
SavingData = 16
SavingProject = 5
SciaSDKError = 21
SyncingModel = 4
Fields
 Name |  Description
 AwaitingUserSelection = 22
 CancellingImport = 7
 ConvertingModelFromXML = 17
 CreatingConnection = 8
 FinishingImport = 20
 ImportFailed = 12
 ImportStarted = 11
 ImportingConnections = 2
 ImportingGroups = 0
 ImportingIOMObject = 9
 ImportingMembers = 1
 ImportingStructuralModel = 10
 InternalImport = 14
 InternalSync = 3
 Member = 15
 ModelImport = 6
 ModelPostProcess = 13
 ProcessingConnection = 19
 ProcessingSubstructure = 18
 SavingData = 16
 SavingProject = 5
 SciaSDKError = 21
 SyncingModel = 4
 Edit this page